leioukupo/Stm32/HARDWARE/Spi/spi1.c
#include "spi.h"
#include "stm32f10x.h"
/*
D0(SCL)-->    PA5 | SPI1_SCK | PB3 |              
D1(sda) -->   PA7 | SPI1_MOSI | PB5 |        
CS      -->   PA4 | SPI1_NSS | PA15 |       
RES(复位,任选)   ---> PA3
DC(数据和命令选择)  ---> PA2
*/
SPI_InitTypeDef spi1_init;

void SPI1_Init(void)
{
    GPIO_InitTypeDef gpio_init;
    RCC_APB2PeriphClockCmd( RCC_APB2Periph_GPIOA | RCC_APB2Periph_SPI1,ENABLE);//打开gpioa时钟和spi1时钟
    gpio_init.GPIO_Pin = GPIO_Pin_5 | GPIO_Pin_7; //SCK(PA5) and MOSI(PA7)
	gpio_init.GPIO_Mode = GPIO_Mode_AF_PP;  //复用推挽输出
	gpio_init.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &gpio_init);
    GPIO_SetBits(GPIOA,GPIO_Pin_5|GPIO_Pin_7);//设置高电平
    spi1_init.SPI_Direction = SPI_Direction_2Lines_FullDuplex;  //设置SPI单向或者双向的数据模式:SPI设置为双线双向全双工
    spi1_init.SPI_Mode = SPI_Mode_Master;		//设置SPI工作模式:设置为主SPI
	spi1_init.SPI_DataSize = SPI_DataSize_8b;		//设置SPI的数据大小:SPI发送接收8位帧结构
	spi1_init.SPI_CPOL = SPI_CPOL_Low;		//选择了串行时钟的稳态:时钟低
	spi1_init.SPI_CPHA = SPI_CPHA_1Edge;	//数据捕获于第一个时钟沿
	spi1_init.SPI_NSS = SPI_NSS_Soft;		//NSS信号由硬件（NSS管脚）还是软件（使用SSI位）管理:内部NSS信号有SSI位控制
	spi1_init.SPI_BaudRatePrescaler = SPI_BaudRatePrescaler_8;		//定义波特率预分频的值:波特率预分频值为8
	spi1_init.SPI_FirstBit = SPI_FirstBit_MSB;	//指定数据传输从MSB位还是LSB位开始:数据传输从MSB位开始
	spi1_init.SPI_CRCPolynomial = 7;	//CRC值计算的多项式
	SPI_Init(SPI1, &spi1_init);  //根据SPI_InitStruct中指定的参数初始化外设SPIx寄存器
    SPI_Cmd(SPI1, ENABLE); //使能SPI外设
	// SPI1_ReadWriteByte(0xff);//启动传输
}
//SPI 速度设置函数
//SpeedSet:
//SPI_BaudRatePrescaler_2   2分频   (SPI 36M@sys 72M)
//SPI_BaudRatePrescaler_8   8分频   (SPI 9M@sys 72M)
//SPI_BaudRatePrescaler_16  16分频  (SPI 4.5M@sys 72M)
//SPI_BaudRatePrescaler_256 256分频 (SPI 281.25K@sys 72M)
  
void SPI1_SetSpeed(u8 SpeedSet)
{
	spi1_init.SPI_BaudRatePrescaler = SpeedSet ;
  	SPI_Init(SPI1, &spi1_init);
	SPI_Cmd(SPI1,ENABLE);
} 
//SPI1 读写一个字节
//TxData:要写入的字节
//返回值:读取到的字节
u8 SPI1_ReadWriteByte(u8 TxData)
{		
	u8 retry=0;				 	
	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_TXE) == RESET) //检查指定的SPI标志位设置与否:发送缓存空标志位
		{
		retry++;
		if(retry>200)return 0;
		}			  
	SPI_I2S_SendData(SPI1, TxData); //通过外设SPIx发送一个数据
	retry=0;

	while (SPI_I2S_GetFlagStatus(SPI1, SPI_I2S_FLAG_RXNE) == RESET)//检查指定的SPI标志位设置与否:接受缓存非空标志位
		{
		retry++;
		if(retry>200)return 0;
		}	  						    
	return SPI_I2S_ReceiveData(SPI1); //返回通过SPIx最近接收的数据					    
}